app/Http/Controllers/Api/StudentController.php

select * from `students` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `students`
---
    public function index()
    {
        return new StudentCollection(
            Student::query()->latest('id')->paginate(10)
        );

select * from `students` where `students`.`id` = '211' limit 1
update `students` set `image` = 'profile/PyuowMjllj3zkUe7dowNObrWEqiU7kiscM5X97La.jpeg', `students`.`updated_at` = '2019-11-26 09:52:23' where `id` = 211
---
    public function update(Request $request, $id)
    {
        $data = $this->validate($request, [
            'name' => 'required',
            'email' => "required|email|unique:students,email,{$id}",
            'phone' => "required|unique:students,phone,{$id}",
            'address' => 'required',
            'image' => 'nullable|image|mimes:jpeg,jpg,png',
        ]);
        $student = Student::query()->findOrFail($id);

        $image = $request->file('image');

        if ($request->hasFile('image')) {
            $imageUrl = $image->store('profile');
            Storage::delete($student->image);

            $data['image'] = $imageUrl;
        }

        $student->update($data);

select * from `students` where `students`.`id` = '212' limit 1
delete from `students` where `id` = 212
---
    public function destroy($id)
    {
        $student = Student::query()->findOrFail($id);

        $student->delete();